Act as an expert commodity market analyst specializing in agricultural futures, particularly soybeans. Your analysis will be used as input for a probabilistic model that predicts soy futures prices.

Analyze the following news article text. Your primary goal is to extract structured, quantifiable data.

**Article:**
{article_text}

**Task:**
Provide your analysis in a single JSON object. Do not include any explanatory text before or after the JSON. The JSON object must contain the following keys:

1.  `"summary"`: A concise, neutral summary of the article's main points in no more than three sentences.
2.  `"overall_sentiment_score"`: A single floating-point number from -1.0 (extremely negative for the soy market) to 1.0 (extremely positive for the soy market). 0.0 represents a neutral sentiment.
3.  `"key_factors"`: A JSON array of strings. List the primary economic, political, or environmental factors mentioned that could influence soy prices (e.g., "weather conditions in Brazil," "US trade policy," "demand from China").
4.  `"market_impact_score"`: An integer from 1 (minimal impact) to 10 (market-moving event) representing the potential significance of the news.
5.  `"regional_impact"`: A JSON object with keys for "brazil", "usa", and "argentina". For each country, provide an object with two keys:
    * `"sentiment"`: A float from -1.0 to 1.0 for that specific region.
    * `"reasoning"`: A brief string explaining the sentiment for that region based on the article. If the article does not mention a region, the sentiment should be 0.0 and the reasoning "Not mentioned in the article."
6.  `"confidence_score"`: A float from 0.0 to 1.0 indicating your confidence in the analysis based on the clarity and specificity of the provided article.
--
                Pretend to be an financial analyst and analyze the following article for its potential 
                impact on the soy prices prices in the b3 market.
                Article content: {article_text}
                for each topic analysis provide using this format:
                Overall sentiment (positive/negative/neutral), Potential market impact (high/medium/low),
                Key points summary (2-3 bullets), Trading recommendation (buy/sell/hold/monitor)

                Provide the response in a json format with keys: sentiment, impact, summary, recommendation.
                    
